import jax.numpy as jnp
from flax.struct import dataclass

#   0 空白
#   1 先手歩
#   2 先手香車
#   3 先手桂馬
#   4 先手銀
#   5 先手角
#   6 先手飛車
#   7 先手金
#   8 先手玉
#   9 先手と
#  10 先手成香
#  11 先手成桂
#  12 先手成銀
#  13 先手馬
#  14 先手龍
#  15 後手歩
#  16 後手香車
#  17 後手桂馬
#  18 後手銀
#  19 後手角
#  20 後手飛車
#  21 後手金
#  22 後手玉
#  23 後手と
#  24 後手成香
#  25 後手成桂
#  26 後手成銀
#  27 後手馬
#  28 後手龍


INIT_PIECE_BOARD = jnp.int8(
    [
        [16, 17, 18, 22, 23, 22, 18, 17, 16],
        [0, 20, 0, 0, 0, 0, 0, 19, 0],
        [15, 15, 15, 15, 15, 15, 15, 15, 15],
        [0, 0, 0, 0, 0, 0, 0, 0, 0],
        [0, 0, 0, 0, 0, 0, 0, 0, 0],
        [0, 0, 0, 0, 0, 0, 0, 0, 0],
        [1, 1, 1, 1, 1, 1, 1, 1, 1],
        [0, 5, 0, 0, 0, 0, 0, 6, 0],
        [2, 3, 4, 7, 8, 7, 4, 3, 2],
    ]
).flatten()


@dataclass
class State:
    turn: jnp.ndarray = jnp.int8(0)  # 0 or 1
    piece_board: jnp.ndarray = INIT_PIECE_BOARD  # (81,)
    hand: jnp.ndarray = jnp.int8((2, 7))


def init():
    """Initialize Shogi State.
    >>> s = init()
    >>> s.piece_board.reshape((9, 9))
    Array([[16, 17, 18, 22, 23, 22, 18, 17, 16],
           [ 0, 20,  0,  0,  0,  0,  0, 19,  0],
           [15, 15, 15, 15, 15, 15, 15, 15, 15],
           [ 0,  0,  0,  0,  0,  0,  0,  0,  0],
           [ 0,  0,  0,  0,  0,  0,  0,  0,  0],
           [ 0,  0,  0,  0,  0,  0,  0,  0,  0],
           [ 1,  1,  1,  1,  1,  1,  1,  1,  1],
           [ 0,  5,  0,  0,  0,  0,  0,  6,  0],
           [ 2,  3,  4,  7,  8,  7,  4,  3,  2]], dtype=int8)
    """
    return State()
